Revit.Elements.ElementWrapper
Element wrapper supplies tools for wrapping Autodesk.Revit.DB.Element types
in their associated Revit.Elements.Element wrapper

Revit.Elements.ElementWrapper.ToDSType(Autodesk.Revit.DB.Element,System.Boolean)
If possible, wrap the element in a DS type
ele:
isRevitOwned: Whether the returned object should be revit owned or not
Returns: